package com.nikitchyn.homework6;

public class ShatlNum {
    //У Японії числа 4 та 9 вважаються нещасливими. Вам потрібно пронумерувати 100 космічних шатлів
    // для перевезення людей на Марс так, щоб у номерах шатлів не траплялося нещасливих чисел.
    // Напишіть функцію, яка виводить усі номери таких шатлів.
    public static void main(String[] args) {
        char a, b;
        int n;
        a = '4';   //нещасливе число
        b = '9';   //нещасливе число
        n = 100;   //кількість шатлів
        numShatl(a, b, n);

    }

    /**
     * Вивидить числа по порядку до n які не містять в c складі a та b
     *
     * @param a значення пропускати1
     * @param b значення пропускати2
     * @param n кількість цифр які задовільняють умовам
     */
    private static void numShatl(char a, char b, int n) {

        int i = 1;//лічильник цифр
        int k = 0;//лічильник уcпішних номерів
        String s3;
        do {
            s3 = Integer.toString(i);//конвертуємо в стрічку
            if (s3.indexOf('4') == -1 && s3.indexOf('9') == -1) { //не знайшли цифри з параметрів
                System.out.println("Шатл " + (k + 1) + " №" + i);
                k++;
            }
            i++;
        } while (k != n);
    }
}
